<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 109.0.1518.49--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Ustawienia zastępowania modułu ładującego</string><string id="BrowserExecutableFolder">Konfiguruj lokalizację folderu wykonywalnego przeglądarki</string><string id="BrowserExecutableFolder_Explain">Te zasady konfigurują aplikacje WebView2 do używania środowiska uruchomieniowego WebView2 w określonej ścieżce. Folder powinien zawierać następujące pliki: msedgewebview2.exe, msedge.dll itp.

Aby określić wartość ścieżki folderu, podaj nazwę wartości i parę wartości. Ustaw nazwę wartości jako identyfikator modelu użytkownika aplikacji lub nazwę pliku wykonywalnego. Aby zastosować je do wszystkich aplikacji, można użyć symbolu wieloznacznego „*” jako nazwy wartości.

Przykładowa wartość:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Konfiguruj lokalizację folderu wykonywalnego przeglądarki</string><string id="ReleaseChannelPreference">Ustaw preferencję kolejności wyszukiwania kanału wersji</string><string id="ReleaseChannelPreference_Explain">Domyślna kolejność wyszukiwania kanałów to środowisko uruchomieniowe WebView2, Beta, Dev i Canary.

Aby odwrócić domyślną kolejność wyszukiwania, ustaw dla tych zasad wartość 1.

Aby ustawić wartość preferencji kanału wersji, podaj nazwę wartości i parę wartości. Ustaw nazwę wartości na identyfikator modelu użytkownika aplikacji lub nazwę pliku wykonywalnego. Aby zastosować je do wszystkich aplikacji, można użyć symbolu wieloznacznego „*” jako nazwy wartości.

Przykładowa wartość:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Ustaw preferencję kolejności wyszukiwania kanału wersji</string><string id="ExperimentationAndConfigurationServiceControl">Kontroluj komunikację z Usługą Eksperymentalno-Konfiguracyjną</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Usługa Eksperymentalno-Konfiguracyjna służy do wdrażania ładunków eksperymentowania i konfiguracji w ramach klienta.

Ładunek eksperymentowania składa się z listy funkcji na wczesnym etapie opracowywania, które firma Microsoft włącza na potrzeby testowania i uzyskiwania opinii.

Ładunek konfiguracji składa się z listy polecanych ustawień, które firma Microsoft chce wdrożyć w celu zoptymalizowania środowiska użytkownika.

Ładunek konfiguracji może też zawierać listę akcji do wykonania w przypadku określonych domen ze względu na zgodność. Na przykład przeglądarka może zastąpić ciąg agenta użytkownika w witrynie internetowej, jeśli ta witryna jest uszkodzona. Każda z tych akcji ma być tymczasowa, gdy firma Microsoft próbuje rozwiązać problem z właścicielem witryny.

Jeśli ustawisz tę zasadę na wartość „FullMode”, zostanie pobrany cały ładunek z Usługi Eksperymentalno-Konfiguracyjnej. Dotyczy to zarówno ładunków eksperymentowania, jak i ładunków konfiguracji.

Jeśli ustawisz tę zasadę na wartość „ConfigurationsOnlyMode”, zostanie pobrany tylko ładunek konfiguracji.

Jeśli ustawisz te zasady na wartość „RestrictedMode”, komunikacja z Usługą Eksperymentalno-Konfiguracyjną zostanie całkowicie zatrzymana. To ustawienie nie jest zalecane przez firmę Microsoft.

  Jeśli te zasady nie zostaną skonfigurowane na urządzeniu zarządzanym, zachowanie w kanałach stabilnym i beta będzie takie samo jak w przypadku wartości „ConfigurationsOnlyMode”. W kanale Canary i kanale dla deweloperów zachowanie będzie takie samo jak w przypadku wartości „FullMode”.

Jeśli te zasady nie zostaną skonfigurowane na urządzeniu zarządzanym, zachowanie będzie takie samo jak w przypadku wartości „FullMode”.

Mapowanie opcji zasad:

* FullMode (2) = Pobierz konfiguracje i eksperymenty

* ConfigurationsOnlyMode (1) = Pobierz tylko konfiguracje

* RestrictedMode (0) = Wyłącz komunikację z Usługą Eksperymentalno-Konfiguracyjną

Użyj powyższych informacji, konfigurując tę zasadę.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Pobierz konfiguracje i eksperymenty</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Pobierz tylko konfiguracje</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Wyłącz komunikację z Usługą Eksperymentalno-Konfiguracyjną</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge, wersja 97, system Windows 7 lub nowszy</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge, wersja 87, system Windows 7 lub nowszy</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Ustawienia domyślne (użytkownicy mogą je zastąpić)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Określ nazwę wartości jako identyfikator modelu użytkownika aplikacji lub nazwę pliku wykonywalnego. Do zastosowania do wszystkich aplikacji można użyć symbolu wieloznacznego &quot;*&quot; jako nazwy wartości.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Określ nazwę wartości jako identyfikator modelu użytkownika aplikacji lub nazwę pliku wykonywalnego. Do zastosowania do wszystkich aplikacji można użyć symbolu wieloznacznego &quot;*&quot; jako nazwy wartości.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Kontroluj komunikację z Usługą Eksperymentalno-Konfiguracyjną</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>